[
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > External Hard Drives", 
        "ORIGINAL_PRICE": "$949.95", 
        "NAME": "G-Technology G-SPEED eS PRO High-Performance Fail-Safe RAID Solution for HD/2K Production 8TB (0G01873)", 
        "RATINGS": "1.0 out of 5 stars , 1.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B0046UR4F4", 
        "SALE_PRICE": "$949.95", 
        "REVIEWS_BODY": "Failed before the warranty expired and had to pay another company to recover all of the data, which cost a huge amount of money.  Returned the unit to G-Tech and was informed that the package arrived damaged, which was not the fault of my company's shipping department, it turned out to UPS's fault and UPS is paying for it now. , However, through the entire process, which has been going on for a month now, the support folks at G-Technology have been kind of not very helpful or knowledgeable, if not downright resistant and not caring.  Very frustrating\n , \n  I have been a loyal G-TECH/G-SPEED customer for six years. I recommended this product to everyone because it was a tight, loyal RAID and I loved their customer support. Then I upgraded to Mac OS X and the drives would no longer mount. Not only that, but their customer support seems to not have a clue what is going on. , I've just spent the day on tech support with my IT guy only to find out that these drives are no longer officially supported by G-TECH yet, here they are for sale online. I can't tell you how upset I am, considering I have five years' worth of data on these drives, each of which cost around $2,500. , I am now trying to figure out if there is a workaround to get my data off these drives, or if I know anyone with an old Mac OS that I can use to copy files over to a new Pegasus drive. Extremely disappointed. This is absolutely unbelievable. DO NOT BUY THIS DRIVE.", 
        "AVAILABILITY": "Only 1 left in stock.", 
        "REVIEWS_TITLE": "Frustrating support from company , I recommended this product to everyone because it was a tight"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > External Hard Drives", 
        "ORIGINAL_PRICE": "$88.99", 
        "NAME": "G-Technology G-DRIVE ev USB 3.0 Hard Drive 500GB (0G02727)", 
        "RATINGS": "4.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00JGTVU5A", 
        "SALE_PRICE": "$88.99", 
        "REVIEWS_BODY": "Does the job", 
        "AVAILABILITY": "Only 2 left in stock.", 
        "REVIEWS_TITLE": "Four Stars"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > External Hard Drives", 
        "ORIGINAL_PRICE": "$699.95", 
        "NAME": "G-Technology G-DRIVE PRO with Thunderbolt High Speed Portable RAID Solution 2TB (0G02828)", 
        "RATINGS": "5.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00GJYCIVK", 
        "SALE_PRICE": "$699.95", 
        "REVIEWS_BODY": "Very fast drive.  Inexpensive.", 
        "AVAILABILITY": "Only 1 left in stock.", 
        "REVIEWS_TITLE": "Five Stars"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > External Hard Drives", 
        "ORIGINAL_PRICE": "$949.95", 
        "NAME": "G-Technology G-SPEED Q High-Performance 4-Bay RAID Storage Solution 8TB (USB3.0/eSATA/FireWire 800) (0G02836)", 
        "RATINGS": "5.0 out of 5 stars , 4.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00EPGK7CQ", 
        "SALE_PRICE": "$949.95", 
        "REVIEWS_BODY": ", My unit arrived quickly, very well packaged and functioned right out of the box. I have a Mac 27\",  a 17\" Mac Book Pro and I must say it took longer to unpack it than it did to get up and running. I use this G-Speed Q in Raid 5 and down load only photo files to it. I purchased a spare 2TB drive as a \"Hot-Swap\" back-up drive for this Raid 5 set-up. This drive is fast and integrates into my workflow perfectly. I only store my image files on my computers as a temporary measure while working with them in Adobe PSCS6 and LR5. I then transfer them to this G-Speed Q for my first level of secure storage. For my second and third level of secure storage I download all images to my (4) G-Tech G-Dock ev 2 Bay Drives with 10 1TB G-Dock drives. 2 of those ten 1 TB Drives are for back-up replacements, only! Level two secured images are stored on individual 1 TB G-Dock ev Drives and placed securely in my 2 hr fire safe and stored off site. The Level three images are kept on site, ready for use or transfer. The G-Dock ev Drives are small, fast and can be plugged into and used with any computer with a USB 2.0/3.0 port, while on travel, in the field shooting, etc. Then when returning, plug them into the G-Dock for lightning fast downloads and transfer to the G-Tech Q raid 5 Unit for storage & processing and then to the 1 TB ev Drives stored in the safe. , OK, sounds like a lot but if you have ever lost images to a crashed computer HD, failed HD or fire and theft etc. you need to have a redundancy storage back-up plan or suffer the loss. Trust me, it will happen, it is just a matter of when?? , I completely recommend the G Technology product line. It is the best I have ever used and I will continue to use this Great Gear!! , Read more › , \n , \n  Great drive. Just cost to much", 
        "AVAILABILITY": "Only 1 left in stock.", 
        "REVIEWS_TITLE": "\"One Outstanding Drive\" This G-Tech G-Speed Q Is! , Four Stars"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > External Hard Drives", 
        "ORIGINAL_PRICE": "$1,699.95", 
        "NAME": "G-Technology G-SPEED Q High-Performance 4-Bay RAID Storage Solution 16TB (USB3.0/eSATA/FireWire 800) (0G02840)", 
        "RATINGS": "5.0 out of 5 stars , 4.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00EPGKA4G", 
        "SALE_PRICE": "$1,699.95", 
        "REVIEWS_BODY": ", My unit arrived quickly, very well packaged and functioned right out of the box. I have a Mac 27\",  a 17\" Mac Book Pro and I must say it took longer to unpack it than it did to get up and running. I use this G-Speed Q in Raid 5 and down load only photo files to it. I purchased a spare 2TB drive as a \"Hot-Swap\" back-up drive for this Raid 5 set-up. This drive is fast and integrates into my workflow perfectly. I only store my image files on my computers as a temporary measure while working with them in Adobe PSCS6 and LR5. I then transfer them to this G-Speed Q for my first level of secure storage. For my second and third level of secure storage I download all images to my (4) G-Tech G-Dock ev 2 Bay Drives with 10 1TB G-Dock drives. 2 of those ten 1 TB Drives are for back-up replacements, only! Level two secured images are stored on individual 1 TB G-Dock ev Drives and placed securely in my 2 hr fire safe and stored off site. The Level three images are kept on site, ready for use or transfer. The G-Dock ev Drives are small, fast and can be plugged into and used with any computer with a USB 2.0/3.0 port, while on travel, in the field shooting, etc. Then when returning, plug them into the G-Dock for lightning fast downloads and transfer to the G-Tech Q raid 5 Unit for storage & processing and then to the 1 TB ev Drives stored in the safe. , OK, sounds like a lot but if you have ever lost images to a crashed computer HD, failed HD or fire and theft etc. you need to have a redundancy storage back-up plan or suffer the loss. Trust me, it will happen, it is just a matter of when?? , I completely recommend the G Technology product line. It is the best I have ever used and I will continue to use this Great Gear!! , Read more › , \n , \n  Great drive. Just cost to much", 
        "AVAILABILITY": "Only 2 left in stock.", 
        "REVIEWS_TITLE": "\"One Outstanding Drive\" This G-Tech G-Speed Q Is! , Four Stars"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Computer Accessories & Peripherals > Hard Drive Accessories > Hard Drive Enclosures", 
        "ORIGINAL_PRICE": "$299.95", 
        "NAME": "G-Technology G-Dock ev with Thunderbolt", 
        "RATINGS": "5.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00YW5DLB4", 
        "SALE_PRICE": "$299.95", 
        "REVIEWS_BODY": "I am a return customer for this product. My 1st purchase included the G-Dock and 8 1TB drives. I use them mostly for original image archival storage and processed photo files storage. I purchased the second G-Drive Dock ev to have 4 active drives and 4 back-up drives stored in a waterproof & 2 hour rated safe. In addition,  I have the G-Speed Q 4 Drive 12 TB raid set-up for complete system back-up and photo storage. Works perfectly with my Mac Time Machine back up software. I have been extremely satisfied with the G-TECHNOLAGY and have never had a problem of any kind. I highly recommend this product line, the very best quality for sure. , The PhotogDog , 1-4-2016:  Again, I am a return customer and this is my third purchase from this High Speed Vender!! I have had the best service ever, always one day turn around, best price point ever and a product that has and is serving me well. I now have (4) G-Dock ev units and (8) 1 TB G-Drives ev's Daisy Chained together . Best system ever, totally seamless and 0 problems! My G-Speed Q 4 drive 12 TB raid system is still backing up 3 of my Mac computers without a hick-up, ever! Yes, I paid more for this G-Technology system BUT not having any issues or problems and exceeding my every expectations, \"Well Worth The Effort And Expense!\" , To date and still expanding, I am very pleased and G-Techec has my highest endorsement, A investment well worth the $$'s and time! , The PhotogDog", 
        "AVAILABILITY": "Only 2 left in stock.", 
        "REVIEWS_TITLE": "A DRIVE SYSTEM YOU CAN TRUST, A REAL 5 STAR PRODUCT!"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > External Hard Drives", 
        "ORIGINAL_PRICE": "$279.95", 
        "NAME": "G-Technology G-DRIVE ev 220 2TB External Hard Drive (0G03187)", 
        "RATINGS": "4.0 out of 5 stars , 5.0 out of 5 stars , 5.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00KGD0628", 
        "SALE_PRICE": "$279.95", 
        "REVIEWS_BODY": "I purchased this to use as a remote editing drive for FCPx and Premiere Pro. I got busy enough that I was taking work home every night and needed something that I could actually edit off of and not use just to transfer files from one system to another (that can just take too long when you have to do it daily). , As for the speed of the drive, it's more or less as advertised. I get consistant 200 mbps read and write except for when the drive gets close to full. At that point it can drop to as low as 100 mbps but this is not unusual for any drive once it starts to get full. , I have two disappointments that keep this from a 5* review. , First, I really wanted a portable bus powered drive, which this claims to be. However, what you should know is that it takes two USB ports to power this drive. One for data transfer and one for powering the drive. You could use a USB power adaptor with the drive instead, but it's still a bit more complicated and messy than just plugging a drive in with a single cable. So, be aware if this is a big deal to you. , The second disappointment is that the USB3 connection on the drive itself is kind of a poor fit for the cable. The cable always feels loose and in one case the drive did unmount from the computer because the cable was moved slightly. For something that is marked and sold as a pro level drive, this should not be. It was bad enough that I considered sending it back but then ended up keeping it. I just have to be careful where I place it and make sure I don't need to move the drive at all once connected. , So overall, great drive for editing if you're OK with these two drawbacks.\n , \n  awesome drive and its super fast!\n , \n  I love this unit! , It is compact and very fast! , Plus it has a very large capacity", 
        "AVAILABILITY": "Only 3 left in stock.", 
        "REVIEWS_TITLE": "Pretty good drive for Pro Video Editors , Five Stars , Fast and compact"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > USB Flash Drives", 
        "ORIGINAL_PRICE": "$449.95", 
        "NAME": "G-Technology G-RAID with Removable Drives High-Performance Storage System 4TB (Gen7) (0G03240)", 
        "RATINGS": "4.0 out of 5 stars , 5.0 out of 5 stars , 1.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00O9A48N2", 
        "SALE_PRICE": "$449.95", 
        "REVIEWS_BODY": "East to set up, works quite well (I use it in RAID 1 for duplicate copies of my stuff).  Only drawback - it's not nearly as quiet as some reviewers suggest.\n , \n  Works great. A safe place to store data\n , \n  I bought this on a referral from a fellow photographer.  I have always used WD drives and have been very pleased.  The drive seems to be working ok, but I ran a speed test on it using the Parkdale program and it runs slower than my External single drive WD hard drive that is much cheaper.  So I ask what is the point?  The reason I bought it was for editing photos without having to keep them on my small SSD drive on my laptop  My main issue with this drive is the noise.  The noise from this thing is obnoxious.  It constantly spins and is so loud.  I never even hear any of my other drives.  I called tech support and they say that since there are two drives in the enclosure it will be louder and by nature of the Raid the drives will constantly spin so that it is normal.  This is not normal.  I worked with Raid drives 15 years ago that were never this loud.  Since it is just past the 30 day return mark, I will most likely hook it up to my external network drive that is in another room and use it for additional backup/storage and not my mine working drive and buy something else.  Makes for an expensive backup.", 
        "AVAILABILITY": "Only 3 left in stock.", 
        "REVIEWS_TITLE": "If looking for a reliable RAID 1 backup at reasonable cost, this is it. , Five Stars , I have always used WD drives and have been very pleased. The drive seems to be working ok"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > Internal Hard Drives", 
        "ORIGINAL_PRICE": "$749.95", 
        "NAME": "G-Technology G-RAID with Removable Drives High-Performance Storage System 12TB (Gen7) (0G03411)", 
        "RATINGS": "5.0 out of 5 stars", 
        "URL": "http://www.amazon.com/dp/B00O9A4MEW", 
        "SALE_PRICE": "$749.95", 
        "REVIEWS_BODY": "great for photographers!", 
        "AVAILABILITY": "Only 2 left in stock.", 
        "REVIEWS_TITLE": "Five Stars"
    }, 
    {
        "CATEGORY": "Electronics > Computers & Accessories > Data Storage > USB Flash Drives", 
        "ORIGINAL_PRICE": "$549.95", 
        "NAME": "G-Technology G-RAID USB Removable Dual Drive Storage System 8TB (0G04069)", 
        "RATINGS": null, 
        "URL": "http://www.amazon.com/dp/B00UZKG8QU", 
        "SALE_PRICE": "$549.95", 
        "REVIEWS_BODY": null, 
        "AVAILABILITY": "Only 1 left in stock.", 
        "REVIEWS_TITLE": null
    }
]